index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="this a blog to talk about development python and emacs">
<meta name="viewport" content="width=device-width">
<title>edil3ra | edil3ra</title>
<link href="assets/css/all.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="//fonts.googleapis.com/css?family=PT+Serif:400,400italic,700%7CPT+Sans:400">
<link rel="alternate" type="application/rss+xml" title="RSS" href="rss.xml">
<link rel="canonical" href="https://edil3ra.github.io/">
<!--[if lt IE 9]><![endif]--><link rel="prefetch" href="posts/listen-to-music-with-emacs-using-bongo/" type="text/html">
</head>
<body class="theme-base-02">
	<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css">
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>
    <!-- Target for toggling the sidebar `.sidebar-checkbox` is for regular
            styles, `#sidebar-checkbox` for behavior. -->
    <input type="checkbox" class="sidebar-checkbox" id="sidebar-checkbox"><!-- Toggleable sidebar --><div class="sidebar" id="sidebar">
        <div class="sidebar-item">
			Here is my blog i like to tweak emacs and write code in python, i will make tutorial about it
        </div>
        
    <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="pages/cv">CV</a>
    
    
    </nav>
</div>

    <!-- Wrap is the content to shift when toggling the sidebar. We wrap the
         content to avoid any CSS collisions with our real content. -->
	
    <div class="wrap">
		<div class="masthead">
			<div class="container">
				<div class="masthead-wrapper">
					<ul class="masthead-left">
<li>
    <h3 id="brand" class="masthead-title">
		<a href="https://edil3ra.github.io/" title="edil3ra" rel="home">edil3ra</a>
    </h3>
</li>
					</ul>
<ul class="masthead-right">
<li>
							<a href="https://github.com/edil3ra/">
								<i class="fa fa-github fa-2x"></i>
							</a>
							<a href="https://www.linkedin.com/feed/">
								<i class="fa fa-linkedin fa-2x"></i>
							</a>
							<a href="http://stackoverflow.com/users/5858449/houba-vincent">
								<i class="fa fa-stack-overflow fa-2x"></i>
							</a>
							<a href="assets/files/cv.pdf">
								<i class="fa fa-download fa-2x"></i>
							</a>
						</li>
					</ul>
</div>
		</div>



	  
      <div class="container content" id="content">
        

<div class="posts">
    <article class="post h-entry post-text"><header><h1 class="post-title p-name"><a href="posts/listen-to-music-with-emacs-using-bongo/" class="u-url">Listen to music with emacs using bongo</a></h1>
		
        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">edil3ra</span></p>
            <p class="dateline"><a href="posts/listen-to-music-with-emacs-using-bongo/" rel="bookmark"><time class="post-date published dt-published" datetime="2017-04-08T22:17:33+02:00" title="2017-04-08 22:17">2017-04-08 22:17</time></a></p>
                <p class="commentline">
        
    <a href="posts/listen-to-music-with-emacs-using-bongo/#disqus_thread" data-disqus-identifier="cache/posts/listen-to-music-with-emacs-using-bongo.html">Comments</a>


        </p>
</div>
    </header><div class="e-content entry-content">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Basic settings for the bongo package</h2>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">dependencies</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>use-package
</li>
</ul>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="nf">use-package</span> <span class="nv">bongo</span>
  <span class="nv">:ensure</span> <span class="nv">t</span> <span class="nv">:defer</span> <span class="nv">t</span>
  <span class="nv">:init</span> <span class="p">(</span><span class="nf">progn</span>
		  <span class="p">(</span><span class="nf">setq</span> <span class="nv">bongo-default-directory</span> <span class="s">"~/Music/"</span>
				<span class="nv">bongo-confirm-flush-playlist</span> <span class="nv">nil</span>
				<span class="nv">bongo-insert-whole-directory-trees</span> <span class="nv">nil</span><span class="p">)))</span>
</pre></div>






<div class="highlight"><pre><span></span><span class="p">(</span><span class="nf">use-package</span> <span class="nv">bongo</span>
  <span class="nv">:ensure</span> <span class="nv">t</span> <span class="nv">:defer</span> <span class="nv">t</span>
  <span class="nv">:init</span> <span class="p">(</span><span class="nf">progn</span>
		  <span class="p">(</span><span class="nf">defun</span> <span class="nv">my/bongo-play-first</span> <span class="p">()</span>
			<span class="p">(</span><span class="nf">interactive</span><span class="p">)</span>
			<span class="p">(</span><span class="nf">with-current-buffer</span> <span class="p">(</span><span class="nf">bongo-buffer</span><span class="p">)</span>
			  <span class="p">(</span><span class="nf">save-excursion</span>
				<span class="p">(</span><span class="nf">beginning-of-buffer</span><span class="p">)</span>
				<span class="p">(</span><span class="nf">next-line</span> <span class="mi">14</span><span class="p">)</span>
				<span class="p">(</span><span class="nf">bongo-play</span><span class="p">))))</span>

		  <span class="p">(</span><span class="nf">defun</span> <span class="nv">my/bongo-play-last</span> <span class="p">()</span>
			<span class="p">(</span><span class="nf">interactive</span><span class="p">)</span>
			<span class="p">(</span><span class="nf">with-current-buffer</span> <span class="p">(</span><span class="nf">bongo-buffer</span><span class="p">)</span>
			  <span class="p">(</span><span class="nf">save-excursion</span>
				<span class="p">(</span><span class="nf">end-of-buffer</span><span class="p">)</span>
				<span class="p">(</span><span class="nf">previous-line</span><span class="p">)</span>
				<span class="p">(</span><span class="nf">bongo-play</span><span class="p">))))</span>

		  <span class="p">(</span><span class="nf">defun</span> <span class="nv">my/bongo-kill-current</span> <span class="p">()</span>
			<span class="p">(</span><span class="nf">interactive</span><span class="p">)</span>
			<span class="p">(</span><span class="nf">with-current-buffer</span> <span class="p">(</span><span class="nf">bongo-buffer</span><span class="p">)</span>
			  <span class="p">(</span><span class="nf">save-excursion</span>
				<span class="p">(</span><span class="nf">bongo-stop</span><span class="p">)</span>
				<span class="p">(</span><span class="nf">bongo-recenter</span><span class="p">)</span>
				<span class="p">(</span><span class="nf">bongo-kill</span><span class="p">)</span>
				<span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">= </span><span class="mi">0</span> <span class="p">(</span><span class="nf">my/difference-line-point-end-buffer</span><span class="p">))</span>
					<span class="p">(</span><span class="nf">previous-line</span><span class="p">))</span>
				<span class="p">(</span><span class="nf">bongo-play</span><span class="p">))))</span>

		  <span class="p">(</span><span class="nf">setq</span> <span class="nv">bongo-default-directory</span> <span class="s">"~/Music/"</span>
				<span class="nv">bongo-confirm-flush-playlist</span> <span class="nv">nil</span>
				<span class="nv">bongo-insert-whole-directory-trees</span> <span class="nv">nil</span><span class="p">))</span>
  <span class="nv">:config</span><span class="p">(</span><span class="nf">progn</span>
		  <span class="p">(</span><span class="nf">bind-key</span> <span class="s">"."</span> <span class="ss">'my/youtube-dl</span> <span class="nv">bongo-mode-map</span><span class="p">)</span>
		  <span class="p">(</span><span class="nf">bind-key</span> <span class="s">"C-c C-c"</span> <span class="ss">'my/bongo-play-first</span> <span class="nv">bongo-mode-map</span><span class="p">)</span>
		  <span class="p">(</span><span class="nf">bind-key</span> <span class="s">"C-c C-t"</span> <span class="ss">'my/bongo-play-last</span> <span class="nv">bongo-mode-map</span><span class="p">)))</span>
</pre></div>


<div class="highlight"><pre><span></span><span class="p">(</span><span class="nf">defhydra</span> <span class="nv">hydra-bongo</span> <span class="p">(</span><span class="nf">:color</span> <span class="nv">blue</span> <span class="nv">:hint</span> <span class="nv">nil</span><span class="p">)</span>
  <span class="s">"</span>
<span class="s">       ^_c_^             ^_,_^         _p_: pause/resume   _i_: insert</span>
<span class="s">       ^^↑^^             ^^↑^^         _s_ :start/stop     _k_: kill</span>
<span class="s">   _h_ ←   → _n_     _a_ ←   → _e_     _l_: library        _u_: youtube</span>
<span class="s">       ^^↓^^             ^^↓^^         _r_: random</span>
<span class="s">       ^_t_^             ^_o_^         </span>
<span class="s">"</span>
  <span class="p">(</span><span class="s">"."</span> <span class="nv">bongo-playlist</span> <span class="nv">:color</span> <span class="nv">red</span><span class="p">)</span>
  <span class="p">(</span><span class="s">"h"</span> <span class="nv">bongo-play-previous</span> <span class="nv">:color</span> <span class="nv">pink</span><span class="p">)</span>
  <span class="p">(</span><span class="s">"c"</span> <span class="nv">my/bongo-play-first</span>  <span class="nv">:color</span> <span class="nv">pink</span><span class="p">)</span>
  <span class="p">(</span><span class="s">"n"</span> <span class="nv">bongo-play-next</span> <span class="nv">:color</span> <span class="nv">pink</span><span class="p">)</span>
  <span class="p">(</span><span class="s">"t"</span> <span class="nv">my/bongo-play-last</span> <span class="nv">:color</span> <span class="nv">pink</span><span class="p">)</span>
  <span class="p">(</span><span class="s">","</span> <span class="nv">bongo-seek-backward-60</span> <span class="nv">:color</span> <span class="nv">pink</span><span class="p">)</span>
  <span class="p">(</span><span class="s">"a"</span> <span class="nv">bongo-seek-backward-10</span> <span class="nv">:color</span> <span class="nv">pink</span><span class="p">)</span>
  <span class="p">(</span><span class="s">"e"</span> <span class="nv">bongo-seek-forward-60</span> <span class="nv">:color</span> <span class="nv">pink</span><span class="p">)</span>
  <span class="p">(</span><span class="s">"o"</span> <span class="nv">bongo-seek-forward-10</span> <span class="nv">:color</span> <span class="nv">pink</span><span class="p">)</span>
  <span class="p">(</span><span class="s">"p"</span> <span class="nv">bongo-pause/resume</span> <span class="nv">:color</span> <span class="nv">red</span><span class="p">)</span>
  <span class="p">(</span><span class="s">"s"</span> <span class="nv">bongo-start/stop</span> <span class="nv">:color</span> <span class="nv">pink</span><span class="p">)</span>
  <span class="p">(</span><span class="s">"l"</span> <span class="nv">bongo</span> <span class="nv">:color</span> <span class="nv">red</span><span class="p">)</span>
  <span class="p">(</span><span class="s">"r"</span> <span class="nv">bongo-play-random</span> <span class="nv">:color</span> <span class="nv">red</span><span class="p">)</span>
  <span class="p">(</span><span class="s">"i"</span> <span class="nv">bongo-insert-file</span> <span class="nv">:color</span> <span class="nv">red</span><span class="p">)</span>
  <span class="p">(</span><span class="s">"k"</span> <span class="nv">my/bongo-kill-current</span> <span class="nv">:color</span> <span class="nv">pink</span><span class="p">)</span>
  <span class="p">(</span><span class="s">"u"</span> <span class="nv">my/youtube-dl</span><span class="p">)</span>
  <span class="p">(</span><span class="s">"g"</span> <span class="nv">my/kill-buffer</span> <span class="nv">:color</span> <span class="nv">red</span><span class="p">)</span>
  <span class="p">(</span><span class="s">"q"</span> <span class="nv">nil</span> <span class="nv">:color</span> <span class="nv">blue</span><span class="p">))</span>
</pre></div>
</div>
</div>
    </div>
    </article>
</div>



        
       <script>var disqus_shortname="sudo apt-get install httrack";(function(){var a=document.createElement("script");a.async=true;a.src="https://"+disqus_shortname+".disqus.com/count.js";(document.getElementsByTagName("head")[0]||document.getElementsByTagName("body")[0]).appendChild(a)}());</script><footer id="footer"><p>Contents © 2017         <a href="mailto:edil3ra@gmail.com">edil3ra</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </div>
    <label for="sidebar-checkbox" class="sidebar-toggle"></label>
    
    
    
            <script src="assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</div>
</body>
</html>
